src/Reports/ПланИФактПоступлений/ПланИФактПоступлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ПланИФактПоступлений</name>
</mdclass:Report>

src/AccumulationRegisters/ПлатежиПоДоговорам/ПлатежиПоДоговорам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПлатежиПоДоговорам</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыАрендаторов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Арендатор</name>
    <type>
      <types>CatalogRef.Арендаторы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МесяцОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Catalogs/ДоговорыАрендаторов/ДоговорыАрендаторов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыАрендаторов</name>
  <owners>Catalog.Арендаторы</owners>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровАренды</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредметДоговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автопродление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаАрендыЗаМесяц</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбеспечительныйПлатеж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДеньОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДоговоровАренды</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадьПоДоговору</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Помещения</name>
    <attributes>
      <name>Помещение</name>
      <type>
        <types>CatalogRef.Помещения</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаЗаКвМ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Площадь</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГрафикПлатежей</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Reports/ПланИФактПоступлений/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВывестиРезультат(ДокументРезультат);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВывестиРезультат(ДокументРезультат)
	
	Таблица = СформироватьТаблицу();
	
	ДокументРезультат.Очистить();
	
	Шапка = Новый Массив;
	Шапка.Добавить("Договор");
	Шапка.Добавить("Период");
	Шапка.Добавить("План");
	Шапка.Добавить("Факт");
	
	Для Колонка = 1 По Шапка.Количество() Цикл
		Область = ДокументРезультат.Область(1, Колонка, 1, Колонка);
		Область.Текст = Шапка[Колонка - 1];
	КонецЦикла;
	
	НомерСтроки = 1;
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		
		НомерСтроки = НомерСтроки + 1;
		
		ДокументРезультат.Область(НомерСтроки, 1, НомерСтроки, 1).Текст = Строка(СтрокаТаблицы.Договор);
		ДокументРезультат.Область(НомерСтроки, 2, НомерСтроки, 2).Текст = Формат(СтрокаТаблицы.Период, "ДЛФ=DD");
		ДокументРезультат.Область(НомерСтроки, 3, НомерСтроки, 3).Текст = Формат(СтрокаТаблицы.План, "ЧДЦ=2");
		ДокументРезультат.Область(НомерСтроки, 4, НомерСтроки, 4).Текст = Формат(СтрокаТаблицы.Факт, "ЧДЦ=2");
		
	КонецЦикла;
	
	ДокументРезультат.Область(1, 1, 1, 1).ШиринаКолонки = 35;
	ДокументРезультат.Область(1, 2, 1, 2).ШиринаКолонки = 12;
	ДокументРезультат.Область(1, 3, 1, 3).ШиринаКолонки = 15;
	ДокументРезультат.Область(1, 4, 1, 4).ШиринаКолонки = 15;
	
КонецПроцедуры

Функция СформироватьТаблицу()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Т.Договор КАК Договор,
		|	Т.Период КАК Период,
		|	СУММА(Т.План) КАК План,
		|	СУММА(Т.Факт) КАК Факт
		|ИЗ
		|	(ВЫБРАТЬ
		|		ГрафикПлатежей.Ссылка КАК Договор,
		|		НАЧАЛОПЕРИОДА(ГрафикПлатежей.Период, МЕСЯЦ) КАК Период,
		|		СУММА(ГрафикПлатежей.Сумма) КАК План,
		|		0 КАК Факт
		|	ИЗ
		|		Справочник.ДоговорыАрендаторов.ГрафикПлатежей КАК ГрафикПлатежей
		|	СГРУППИРОВАТЬ ПО
		|		ГрафикПлатежей.Ссылка,
		|		НАЧАЛОПЕРИОДА(ГрафикПлатежей.Период, МЕСЯЦ)
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		ПлатежиПоДоговорам.Договор,
		|		ПлатежиПоДоговорам.МесяцОплаты,
		|		0,
		|		СУММА(ПлатежиПоДоговорам.Сумма)
		|	ИЗ
		|		РегистрНакопления.ПлатежиПоДоговорам КАК ПлатежиПоДоговорам
		|	СГРУППИРОВАТЬ ПО
		|		ПлатежиПоДоговорам.Договор,
		|		ПлатежиПоДоговорам.МесяцОплаты) КАК Т
		|СГРУППИРОВАТЬ ПО
		|	Т.Договор,
		|	Т.Период
		|УПОРЯДОЧИТЬ ПО
		|	Договор,
		|	Период";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти
